{
  "backend/main.mo": "Defines an empty Internet Computer Motoko actor with no methods or state.",
  "feature_evidence.json": "Machine-readable report describing implemented features, related files, components, test requirements, and confidence levels for custom domain UI and documentation.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend source files, styles, configuration, hooks, and documentation for build and feature planning.",
  "frontend/docs/custom-domain.md": "Detailed, provider-agnostic documentation explaining how to configure DNS records to point a custom domain to an Internet Computer application.",
  "frontend/index.css": "Global Tailwind CSS base styles defining light and dark theme design tokens, layout defaults, and color variables for the romantic theme.",
  "frontend/index.html": "HTML entry point that mounts the React application and sets page metadata and title.",
  "frontend/README.md": "Frontend project README outlining features, custom domain setup overview, and development prerequisites for the Valentine’s Day app.",
  "frontend/src/App.tsx": "Main React component implementing the Valentine’s Day interaction flow, evasive No button logic, success view, and access to the custom domain settings panel.",
  "frontend/src/components/CustomDomainPanel.tsx": "Dialog component that guides users through custom domain setup by showing the current canister URL, accepting a domain name, and providing copyable DNS instructions.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an Internet Computer backend actor using React Query, handling authenticated and anonymous identities.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context and hook to manage Internet Identity authentication, including login, logout, persisted identity loading, and detailed login status flags using @dfinity/auth-client.",
  "frontend/src/hooks/useLocalStorage.ts": "Provides a generic React hook that syncs state with localStorage in an SSR-safe way and listens for cross-tab storage changes.",
  "frontend/src/index.css": "Defines Tailwind CSS base, theme variables, and utilities, including a custom romantic pink color palette with light and dark mode support.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app, wiring up React Query and the InternetIdentityProvider before rendering App.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with dark mode, content paths, plugins, and an extended theme that maps CSS variables to design tokens and component styles.",
  "project_state.json": "Tracks high-level project metadata, existing features, and versions, describing the Valentine-themed ICP app, its frontend/backend scaffolding, and planned enhancements."
}