{
  "kind": "build_request",
  "title": "Add custom domain setup guidance and domain input for the deployed Valentine page",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a “Custom domain” setup view in the frontend that lets the user enter a domain name (e.g., example.com) and displays clear, step-by-step instructions for pointing that domain to the currently deployed Internet Computer app URL (canister URL), including showing the current canister URL and providing copy-to-clipboard for the URL and any DNS values shown.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Can you give me url here or custom url",
          "2"
        ]
      },
      "acceptanceCriteria": [
        "The UI includes an input for a domain name and stores it locally so it persists on refresh.",
        "The UI displays the current IC app URL (canister URL) used to access the deployed site and provides a one-click copy action.",
        "All user-facing text in this view is in English."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add repository documentation (README section or a new docs page referenced from the README) describing how to set up a custom domain for this Internet Computer-hosted frontend, including what DNS records the user must create and where they should expect the site to be reachable after propagation (while keeping the instructions provider-agnostic).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "custom url",
          "2"
        ]
      },
      "acceptanceCriteria": [
        "Documentation is written in English and is specific enough that a user can follow it without needing additional context from the chat.",
        "Documentation includes a short troubleshooting section (e.g., DNS propagation time, HTTPS/certificate expectations, and common misconfiguration symptoms)."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui).",
    "Keep the backend as a single Motoko actor; do not introduce additional backend services."
  ],
  "nonGoals": [
    "Purchasing/registering a domain on the user’s behalf.",
    "Automatically configuring DNS records with a third-party DNS provider API.",
    "Implementing a custom backend domain-verification or certificate management service."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}