{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Custom domain guidance UI + documentation for IC-hosted Valentine page",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add an in-app “Custom domain” view with a persisted domain input, display the current canister URL, and provide copy-to-clipboard for the URL and DNS values with clear English setup steps.",
      "acceptanceCriteria": [
        "The UI includes an input for a domain name and stores it locally so it persists on refresh.",
        "The UI displays the current IC app URL (canister URL) used to access the deployed site and provides a one-click copy action.",
        "All user-facing text in this view is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a “Custom domain” setup view (as an in-app panel/modal/section to avoid new routing) that: (1) lets the user enter a domain name and persists it via localStorage, (2) reads and displays the current deployed canister URL from the runtime location (e.g., window.location.origin) with a one-click copy action, and (3) shows provider-agnostic, step-by-step DNS instructions including copy-to-clipboard for the computed DNS target/values (e.g., hostname derived from the canister URL). Use shadcn-ui components (e.g., Button plus Input/Card/Separator as appropriate) to structure the view and actions; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useLocalStorage.ts",
          "operation": "create",
          "description": "Create a small reusable hook to read/write a string value to localStorage (domain name) with safe defaults and SSR-safe guards, so the custom domain input persists across refreshes."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add repository documentation under the frontend folder explaining custom domain DNS setup for an IC-hosted frontend, including propagation expectations and troubleshooting.",
      "acceptanceCriteria": [
        "Documentation is written in English and is specific enough that a user can follow it without needing additional context from the chat.",
        "Documentation includes a short troubleshooting section (e.g., DNS propagation time, HTTPS/certificate expectations, and common misconfiguration symptoms)."
      ],
      "file_operations": [
        {
          "path": "frontend/README.md",
          "operation": "create",
          "description": "Create a frontend-level README that includes a clearly labeled “Custom domain setup” section and links to a dedicated docs page. Keep instructions provider-agnostic while explicitly describing which DNS record types/values to create and what URL(s) should work after propagation."
        },
        {
          "path": "frontend/docs/custom-domain.md",
          "operation": "create",
          "description": "Add a detailed custom-domain guide for an Internet Computer-hosted frontend covering: selecting apex vs subdomain, creating the appropriate DNS records (e.g., CNAME for a subdomain to the canister host; apex options like ALIAS/ANAME or redirect-to-subdomain), what to expect after DNS propagation, and a troubleshooting section (propagation delays, HTTPS/certificate timing/expectations, and common misconfiguration symptoms)."
        }
      ]
    }
  ]
}